In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('books.db')

In [4]:
import pandas as pd

In [7]:
pd.read_sql("""SELECT first, last, isbn
FROM authors
INNER JOIN author_ISBN
ON authors.id=author_ISBN.id
ORDER BY last, first """, connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

In [8]:
print('17.2.5 Practice completed by Malcolm Phillip')

17.2.5 Practice completed by Malcolm Phillip

In [13]:
cursor = connection.cursor()

In [17]:
cursor = cursor.execute("""INSERT INTO authors (first, last)
VALUES ('Sue', 'Red')""")

In [16]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [19]:
cursor = cursor.execute("""UPDATE authors SET last='Black'
WHERE last='Red' AND first='Sue' """)

In [20]:
cursor.rowcount

0

In [21]:
print('Practice files completed by Malcolm Phillip')

Practice files completed by Malcolm Phillip